In [ ]:
import pandas as pd
from sdmetrics import load_demo
from sdmetrics.reports.single_table import QualityReport

smote = pd.read_csv("titanic_smote.csv")
titanic = pd.read_csv("/home/alex/demo/data-generators/titanic.csv")
gmm = pd.read_csv("titanic_gmm.csv")
resample = pd.read_csv("titanic_resample.csv")

ModuleNotFoundError: No module named 'sdmetrics'

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
smote.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,170,3,"Ling, Mr. Lee",male,28.000000,0,0,1601,56.4958,B96 B98,S,0
1,6,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,B96 B98,Q,0
2,450,1,"Peuchen, Major. Arthur Godfrey",male,52.000000,0,0,113786,30.5000,C104,S,1
3,819,3,"Holm, Mr. John Fredrik Alexander",male,43.000000,0,0,C 7075,6.4500,B96 B98,S,0
4,305,3,"Williams, Mr. Howard Hugh ""Harry""",male,29.699118,0,0,A/5 2466,8.0500,B96 B98,S,0

In [9]:
gmm.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Name,Sex,Ticket,Cabin,Embarked,Survived
0,311.451492,1.753462,32.288032,0.025163,0.192022,286.234318,"Pettersson, Miss Ellen Natalia",male,364511,B96 B98,S,0
1,769.625394,1.871015,27.630556,-0.087033,0.027050,290.089838,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",male,330979,B96 B98,C,0
2,938.318441,2.525695,41.397781,0.361853,1.387851,66.846018,"Fortune, Mr. Charles Alexander",male,PC 17569,F33,S,1
3,883.809658,2.509081,24.063591,-0.306070,-1.378281,273.017828,"Herman, Miss Alice",male,349248,B96 B98,S,1
4,383.596071,4.682210,11.334404,-0.426849,-1.464925,-239.383536,"Sage, Master Thomas Henry",male,237789,E44,Q,1

In [10]:
resample.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,473,1,2,"West, Mrs. Edwy Arthur (Ada Mary Worth)",female,33.0,1,2,C.A. 34651,27.7500,NaN,S
1,209,1,3,"Carr, Miss Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q
2,459,1,2,"Toomey, Miss Ellen",female,50.0,0,0,F.C.C. 13531,10.5000,NaN,S
3,616,1,2,"Herman, Miss Alice",female,24.0,1,2,220845,65.0000,NaN,S
4,703,0,3,"Barbara, Miss Saiide",female,18.0,0,1,2691,14.4542,NaN,C

In [ ]:

score = evaluate_quality(resample, titanic)
print(score)